openbsd-cheatsheet.org
#+title: OpenBSD Cheat Sheet
#+author: Manos Vasilakis (advizor.gr)
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/style.css" />

* OpenBSD

** The License
- Retain the copyright notice
- No warranty
- Don't use the author's name to promote the product

** =W^X=
- Poineered by the OpenBSD project in 3.3 in 2002, and
  strictly enforced in 6.0
- Memory can either be write or execute, but not both (XOR)
- Similar to PaX Linux Kernel extension (developed later, linux team)
#+BEGIN_EXAMPLE
  1           2   3       4
+---+---+---+---+---+---+---+-----+-----+
| X | W | W | X | X | W | X | W|X | W|X |
+---+---+---+---+---+---+---+-----+-----+
      5   6           7        8     9

- 1,2,3,4: Execute only
- 5,6,7  : Write only
- 8,9    : Write and Execute ->
           Only created by programs on a
           specially marked partition.
#+END_EXAMPLE

** AnonCVS
- First project with a public source tree featuring version control (1995)
- Now an extremely popular model of software development.

** Privilege Separation
- First implementation in 3.2
- Split a program into processes performing defferent sub-functions
- Now used in almost all privileged programs in OpenBSD like: httpd, bgpd,
  dhcpd, syslog, sndio, etc.
#+BEGIN_EXAMPLE
                           Unprivileged Environment
                       +-------------------------------+
+--------+    pipe     | +-------+ +-------+ +-------+ |
| Parent | |---------> | | child | | child | | child | |
+--------+             | +-------+ +-------+ +-------+ |
                       +-------------------------------+
#+END_EXAMPLE

** Privilege Revocation
- pledge (2)
  - Restrict sscall permissions
  - Implemented in OpenBSD 5.9
  - Drop access to syscalls that are no longer needed
  - pledge("stdio dns inet", null) # seconds arg is for any child processes that may be spawned
  - Attempts to access any restricted syscalls after pledge cause the program to be killed
- unveil (2)
  - Restrict file access
  - Implemented in OpenBSD 6.4
  - Hide the filesystem and only expose parts you need
  - unveil("/home/zzz", "r")
  - Accessing anything other than /home/zzz with throw ENOENT
  - Trying to write to /home/zzz will throw EINVAL or EPERM
Really simple compared to other frameworks like capsicum, firejair and used
in most of the base system.

