html/openbsd-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-23 曖 12:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OpenBSD Cheat Sheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Manos Vasilakis (advizor.gr)" />

<link rel="stylesheet" type="text/css" href="./css/style.css" />

</head>
<body>
<div id="content">
<h1 class="title">OpenBSD Cheat Sheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1c8e392">1. OpenBSD</a>
<ul>
<li><a href="#org32dffc9">1.1. The License</a></li>
<li><a href="#org7af364b">1.2. <code>W^X</code></a></li>
<li><a href="#orgf07ea8b">1.3. AnonCVS</a></li>
<li><a href="#orgb4c5049">1.4. Privilege Separation</a></li>
<li><a href="#orgf88aff1">1.5. Privilege Revocation</a></li>
<li><a href="#org5cea014">1.6. Randomization</a></li>
<li><a href="#org97825e0">1.7. Philosophy</a></li>
<li><a href="#org6362f00">1.8. Crypto</a></li>
<li><a href="#orgf4985d1">1.9. Security</a></li>
<li><a href="#orgca13d32">1.10. Cathedral Style Development</a></li>
<li><a href="#org47c3535">1.11. Releases</a></li>
<li><a href="#orgaf553b4">1.12. Projects</a></li>
<li><a href="#org53048bb">1.13. Some Tools</a></li>
<li><a href="#orgfe1816f">1.14. Networking Daemons</a></li>
<li><a href="#org1b7f750">1.15. Use case considerations</a></li>
<li><a href="#org9a5573a">1.16. man (1) Pages</a></li>
<li><a href="#org1762914">1.17. Filesystem hierarchy</a></li>
<li><a href="#org9001049">1.18. User Management</a></li>
<li><a href="#orga989dc3">1.19. syspatch (8)</a></li>
<li><a href="#orgb0505a7">1.20. rc (8)</a></li>
<li><a href="#org1053bed">1.21. Logs</a></li>
<li><a href="#orgc532b67">1.22. Network Interfaces</a></li>
<li><a href="#orgd41875b">1.23. ifconfig (8)</a></li>
<li><a href="#orgb479668">1.24. Package Management</a></li>
<li><a href="#org1ccbd69">1.25. OpenBSD Partitions</a></li>
<li><a href="#org6484641">1.26. Commonly used commands</a></li>
<li><a href="#org74d7649">1.27. Window &amp; Display Managers</a></li>
<li><a href="#org8e0ab2f">1.28. Resources</a></li>
</ul>
</li>
<li><a href="#org6330259">2. The OpenBSD Web Stack</a>
<ul>
<li><a href="#org6217634">2.1. The Software Life Circle</a></li>
<li><a href="#org098db9c">2.2. OpenBSD vs the Software Cyrcle</a></li>
<li><a href="#orgfa741d6">2.3. Web Stack Components</a></li>
<li><a href="#org84bcf98">2.4. LibreSSL &amp; PF</a></li>
<li><a href="#org6b30615">2.5. httpd</a></li>
<li><a href="#orgd83bc6a">2.6. Httpd.conf</a></li>
<li><a href="#org59707c7">2.7. Per-Location Rules</a></li>
<li><a href="#org9893dd9">2.8. Default Server</a></li>
<li><a href="#orgdd85b43">2.9. Blocks and Redirects</a></li>
<li><a href="#org217df6d">2.10. Globs</a></li>
<li><a href="#org5cbdd3b">2.11. Wildcards &amp; Classes</a></li>
<li><a href="#org9c8b7a5">2.12. Perl Regexes</a></li>
<li><a href="#orgf5f22dc">2.13. Lua Patterns</a></li>
<li><a href="#org4466f53">2.14. Lua Character Classes</a></li>
<li><a href="#org47bbc3b">2.15. Custom Lua Classes</a></li>
<li><a href="#org7b7b37c">2.16. Multiples</a></li>
<li><a href="#org71b476b">2.17. Httpd Logs</a></li>
<li><a href="#org3621cfe">2.18. Httpd Debugging</a></li>
<li><a href="#org5a65236">2.19. Dynamic Content</a></li>
<li><a href="#org32e517d">2.20. Httpd Chroot</a></li>
<li><a href="#org54f400f">2.21. Sample App: Wordpress</a></li>
<li><a href="#org80c9d75">2.22. MariaDB socket in chroot</a></li>
<li><a href="#org95e8a6d">2.23. Configure PHP Modules</a></li>
<li><a href="#orged4ca78">2.24. httpd.conf</a></li>
<li><a href="#org0a03f86">2.25. TLS</a></li>
<li><a href="#org37198b8">2.26. Let's Encrypt</a></li>
<li><a href="#org3232df1">2.27. How ACME Works</a></li>
<li><a href="#orgb8485b6">2.28. Configuring httpd for ACME</a></li>
<li><a href="#org2cc50d3">2.29. First acme-client run</a></li>
<li><a href="#org235ee3b">2.30. TLS in httpd.conf</a></li>
<li><a href="#org1109184">2.31. Renew ACME Certs</a></li>
<li><a href="#org2705fe3">2.32. Maintain OCSP</a></li>
<li><a href="#org52f0e90">2.33. More Httpd Bits</a></li>
<li><a href="#org21ebc78">2.34. Relayd</a></li>
<li><a href="#org9f38522">2.35. Relayd Components</a></li>
<li><a href="#org2c93274">2.36. Redirections</a></li>
<li><a href="#org63eca13">2.37. Macros (like any other OpenBSD program)</a></li>
<li><a href="#orgf2d0ed9">2.38. relayctl(8)</a></li>
<li><a href="#org41a9462">2.39. Host Checks</a></li>
<li><a href="#org638cf3e">2.40. More Host Checks</a></li>
<li><a href="#org4783037">2.41. Relays</a></li>
<li><a href="#orgd223879">2.42. SSH Relay</a></li>
<li><a href="#org98a6d62">2.43. Relays let you do weird things</a></li>
<li><a href="#org29ffa7b">2.44. TLS Acceleration</a></li>
<li><a href="#org0b97977">2.45. Other Relay Fun</a></li>
<li><a href="#orgcfe0db9">2.46. Resources</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1c8e392" class="outline-2">
<h2 id="org1c8e392"><span class="section-number-2">1</span> OpenBSD</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org32dffc9" class="outline-3">
<h3 id="org32dffc9"><span class="section-number-3">1.1</span> The License</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Retain the copyright notice</li>
<li>No warranty</li>
<li>Don't use the author's name to promote the product</li>
</ul>
</div>
</div>

<div id="outline-container-org7af364b" class="outline-3">
<h3 id="org7af364b"><span class="section-number-3">1.2</span> <code>W^X</code></h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Poineered by the OpenBSD project in 3.3 in 2002, and
strictly enforced in 6.0</li>
<li>Memory can either be write or execute, but not both (XOR)</li>
<li>Similar to PaX Linux Kernel extension (developed later, linux team)</li>
</ul>
<pre class="example" id="org941b4de">
  1           2   3       4
+---+---+---+---+---+---+---+-----+-----+
| X | W | W | X | X | W | X | W|X | W|X |
+---+---+---+---+---+---+---+-----+-----+
      5   6           7        8     9

- 1,2,3,4: Execute only
- 5,6,7  : Write only
- 8,9    : Write and Execute -&gt;
           Only created by programs on a
           specially marked partition.
</pre>
</div>
</div>

<div id="outline-container-orgf07ea8b" class="outline-3">
<h3 id="orgf07ea8b"><span class="section-number-3">1.3</span> AnonCVS</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>First project with a public source tree featuring version control (1995)</li>
<li>Now an extremely popular model of software development.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb4c5049" class="outline-3">
<h3 id="orgb4c5049"><span class="section-number-3">1.4</span> Privilege Separation</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>First implementation in 3.2</li>
<li>Split a program into processes performing defferent sub-functions</li>
<li>Now used in almost all privileged programs in OpenBSD like: httpd, bgpd,
dhcpd, syslog, sndio, etc.</li>
</ul>
<pre class="example" id="org2993140">
                           Unprivileged Environment
                       +-------------------------------+
+--------+    pipe     | +-------+ +-------+ +-------+ |
| Parent | |---------&gt; | | child | | child | | child | |
+--------+             | +-------+ +-------+ +-------+ |
                       +-------------------------------+
</pre>
</div>
</div>

<div id="outline-container-orgf88aff1" class="outline-3">
<h3 id="orgf88aff1"><span class="section-number-3">1.5</span> Privilege Revocation</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>pledge (2)
<ul class="org-ul">
<li>Restrict sscall permissions</li>
<li>Implemented in OpenBSD 5.9</li>
<li>Drop access to syscalls that are no longer needed</li>
<li>pledge("stdio dns inet", null) # seconds arg is for any child processes that may be spawned</li>
<li>Attempts to access any restricted syscalls after pledge cause the program to be killed</li>
</ul></li>
<li>unveil (2)
<ul class="org-ul">
<li>Restrict file access</li>
<li>Implemented in OpenBSD 6.4</li>
<li>Hide the filesystem and only expose parts you need</li>
<li>unveil("/home/zzz", "r")</li>
<li>Accessing anything other than /home/zzz with throw ENOENT</li>
<li>Trying to write to /home/zzz will throw EINVAL or EPERM</li>
</ul></li>
</ul>
<p>
Really simple compared to other frameworks like capsicum, firejair and used
in most of the base system.
</p>
</div>
</div>
