openbsd-cheatsheet.org
** Randomization
- ASLR
  - First widely used operating system to provide this by default
  - Libraries, heap and program code are randomly distributed through
    virtual memory each time the program starts
  - Random stack offset
- KARL
  - Unique kernel each reboot
  - Relinks kernel C libraries in random orders
  - Adds lot of randomization to the code it self
  - The message "Relinking to create unique kernel... done" on boot
- Library order randomization
  - Randomly relinks libc.so, libcrypto and lb.so on startup
- Kernel ASLR vs KARL
  - Kernel ASLR
    - Same kernel binary
    - Address space randomization
  - KARL
    - Unique binary each boot
    - Linking order randomized
  - OpenBSD does BOTH!
- arc4random (3)
  - Very high quality random numbers
  - Originally used RC4
  - Now uses ChaCha20
#+BEGIN_EXAMPLE
                 RDRAND -------+   +------- Interrupts (latency)
                               |   |
                               V   V
                      +---------------------+
                      | Entropy input queue |
                      +---------------------+
                                  |
                                  V
                             +-----------+
                             | whitening |
                             +-----------+
                                   |
                                   V
                             +----------------+
+------------------+ boot    |                | shutdown   +------------------+
| /etc/random.seed |-------> | ChaCha20 state |----------> | /etc/random.seed |
+------------------+         |                |            +------------------+
                             +----------------+
                                     |
                                     V
 +----------------------------------------------------------------------+
  \                         ChaCha20 stream                              \
  /                                                                      /
 +---------------------+-+-+-+------+-+---------------------------------+
                       | | | |      | |
                  uvm -+ | | |      | +- /dev/random
       pid generation ---+ | |      +--- ...
       IP packets IDs -----+ |
                  etc -------+
#+END_EXAMPLE
- Other
  - Position-Independent Executables (PIE)
    - First OS to enable PIE by default
- RETGUARD
  - Mitigation against ROP exploits
  - Compiler-based exploit mitigation
- Randomized PIDs

** Philosophy
- Correctness
- Portability
- Documentation
- Rewriting bad code
- Keeping it simple

** Crypto
- Founded in Canada
- Avoid US export controls (backdoors)

** Security
- Widely considered to be the most secure OS in the world
- Least privilege principle
- Under constant audit from all developers

** Cathedral Style Development
- One repo to rule them all
- All components properly intergrated

** Releases
- The OS base is released as a whole
  (not like GNU + Linux + other crappy utilities)
- Patches to the OS are installed using syspatch (1)
- Upgrading is done with sysupgrade (1)
- Releases come out every 6 months
- Cool artwork and music

** Projects
- OpenSSH
- LibreSSL
  - Forked from OpenSSL during the Heartbleed vulnerability
  - Massive Effort
  - Legacy code removal
  - Vulnerability fixes
  - Modernization
  - libtls (easy crypto for C!)
- openrsync (1)
  - Rewrite of rsync with a friendly BSD license
  - Privilege separation and revocation, exploit mitigation.
- pf (4)
  - Extremely simple configuration and administration
  - Ported to many other OSs:
    - MacOS
    - iOS
    - FreeBSD
    - NetBSD
    - Solaris
    - QNX
    - Blackberry
    - Others

** Some Tools
- signify
  - cryptographic signature tools used to author releases and verify patches, very simple
- mandoc toolchain
  - Manpage utilities
- sndio
  - OpenBSD sound system. Very simple and flexible (f*ck pipewire & pulseaudio)
- doas
  - A sane sudo, with a line of configuration to understand
- httpd, relayd
  - http server and http/tcp relay
- vmm/vmd
  - Homegrown virtual machines
- switchd
  - Software Defined Networking daemon, implements OpenFlow spec.
- rebound
  - DNS proxy
- unwind
  - Validating DNS resolver
- xenocara
  - Fork of X11
- acme-client
  - Client for LetsEncrypt's ACME service

** Networking Daemons
- OpenSMTPD
- OpenBGPD
  - RPKI-Client
- OpenNTPD
- OpenIKED
- CARP
- DHCPd
- DNS
  - Authoritative - nsd
  - Resolving - unbound
- FTPd
- LDAP
- HostAPd
- NFS
- OSPF
- RADIUSs
- RIPD
- TFTPd
- and more...

** Use case considerations
- Network edge
- Mail servers
- DNS server
- BGP server
- Secure Systems
- Aythentication server
- High risk environments
- Places where correctness and predictability are important
- Increased security causes a small performance hit
- Multiprocessing kernel doesn't fully utilize multi-core processors
- VMs are still experimental and not production ready, but getting there.

** man (1) Pages
- Contain everything
- apropos
- man afterboot # and help
- man hier
- Manpage section: man <#> intro
  - Section 1 - General Commands
  - Section 2 - System calls
  - Section 3 - C library function
  - Section 4 - Device drivers
  - Section 5 - File Formats
  - Section 6 - Games
  - Section 7 - Miscellaneous
  - Section 8 - System Management
  - Section 9 - Kernel Development

