html/openbsd-cheatsheet.html

<div id="outline-container-org5cea014" class="outline-3">
<h3 id="org5cea014"><span class="section-number-3">1.6</span> Randomization</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>ASLR
<ul class="org-ul">
<li>First widely used operating system to provide this by default</li>
<li>Libraries, heap and program code are randomly distributed through
virtual memory each time the program starts</li>
<li>Random stack offset</li>
</ul></li>
<li>KARL
<ul class="org-ul">
<li>Unique kernel each reboot</li>
<li>Relinks kernel C libraries in random orders</li>
<li>Adds lot of randomization to the code it self</li>
<li>The message "Relinking to create unique kernel&#x2026; done" on boot</li>
</ul></li>
<li>Library order randomization
<ul class="org-ul">
<li>Randomly relinks libc.so, libcrypto and lb.so on startup</li>
</ul></li>
<li>Kernel ASLR vs KARL
<ul class="org-ul">
<li>Kernel ASLR
<ul class="org-ul">
<li>Same kernel binary</li>
<li>Address space randomization</li>
</ul></li>
<li>KARL
<ul class="org-ul">
<li>Unique binary each boot</li>
<li>Linking order randomized</li>
</ul></li>
<li>OpenBSD does BOTH!</li>
</ul></li>
<li>arc4random (3)
<ul class="org-ul">
<li>Very high quality random numbers</li>
<li>Originally used RC4</li>
<li>Now uses ChaCha20</li>
</ul></li>
</ul>
<pre class="example" id="org03d59a5">
                 RDRAND -------+   +------- Interrupts (latency)
                               |   |
                               V   V
                      +---------------------+
                      | Entropy input queue |
                      +---------------------+
                                  |
                                  V
                             +-----------+
                             | whitening |
                             +-----------+
                                   |
                                   V
                             +----------------+
+------------------+ boot    |                | shutdown   +------------------+
| /etc/random.seed |-------&gt; | ChaCha20 state |----------&gt; | /etc/random.seed |
+------------------+         |                |            +------------------+
                             +----------------+
                                     |
                                     V
 +----------------------------------------------------------------------+
  \                         ChaCha20 stream                              \
  /                                                                      /
 +---------------------+-+-+-+------+-+---------------------------------+
                       | | | |      | |
                  uvm -+ | | |      | +- /dev/random
       pid generation ---+ | |      +--- ...
       IP packets IDs -----+ |
                  etc -------+
</pre>
<ul class="org-ul">
<li>Other
<ul class="org-ul">
<li>Position-Independent Executables (PIE)
<ul class="org-ul">
<li>First OS to enable PIE by default</li>
</ul></li>
</ul></li>
<li>RETGUARD
<ul class="org-ul">
<li>Mitigation against ROP exploits</li>
<li>Compiler-based exploit mitigation</li>
</ul></li>
<li>Randomized PIDs</li>
</ul>
</div>
</div>

<div id="outline-container-org97825e0" class="outline-3">
<h3 id="org97825e0"><span class="section-number-3">1.7</span> Philosophy</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Correctness</li>
<li>Portability</li>
<li>Documentation</li>
<li>Rewriting bad code</li>
<li>Keeping it simple</li>
</ul>
</div>
</div>

<div id="outline-container-org6362f00" class="outline-3">
<h3 id="org6362f00"><span class="section-number-3">1.8</span> Crypto</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Founded in Canada</li>
<li>Avoid US export controls (backdoors)</li>
</ul>
</div>
</div>

<div id="outline-container-orgf4985d1" class="outline-3">
<h3 id="orgf4985d1"><span class="section-number-3">1.9</span> Security</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Widely considered to be the most secure OS in the world</li>
<li>Least privilege principle</li>
<li>Under constant audit from all developers</li>
</ul>
</div>
</div>

<div id="outline-container-orgca13d32" class="outline-3">
<h3 id="orgca13d32"><span class="section-number-3">1.10</span> Cathedral Style Development</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>One repo to rule them all</li>
<li>All components properly intergrated</li>
</ul>
</div>
</div>

<div id="outline-container-org47c3535" class="outline-3">
<h3 id="org47c3535"><span class="section-number-3">1.11</span> Releases</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>The OS base is released as a whole
(not like GNU + Linux + other crappy utilities)</li>
<li>Patches to the OS are installed using syspatch (1)</li>
<li>Upgrading is done with sysupgrade (1)</li>
<li>Releases come out every 6 months</li>
<li>Cool artwork and music</li>
</ul>
</div>
</div>

<div id="outline-container-orgaf553b4" class="outline-3">
<h3 id="orgaf553b4"><span class="section-number-3">1.12</span> Projects</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>OpenSSH</li>
<li>LibreSSL
<ul class="org-ul">
<li>Forked from OpenSSL during the Heartbleed vulnerability</li>
<li>Massive Effort</li>
<li>Legacy code removal</li>
<li>Vulnerability fixes</li>
<li>Modernization</li>
<li>libtls (easy crypto for C!)</li>
</ul></li>
<li>openrsync (1)
<ul class="org-ul">
<li>Rewrite of rsync with a friendly BSD license</li>
<li>Privilege separation and revocation, exploit mitigation.</li>
</ul></li>
<li>pf (4)
<ul class="org-ul">
<li>Extremely simple configuration and administration</li>
<li>Ported to many other OSs:
<ul class="org-ul">
<li>MacOS</li>
<li>iOS</li>
<li>FreeBSD</li>
<li>NetBSD</li>
<li>Solaris</li>
<li>QNX</li>
<li>Blackberry</li>
<li>Others</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org53048bb" class="outline-3">
<h3 id="org53048bb"><span class="section-number-3">1.13</span> Some Tools</h3>
<div class="outline-text-3" id="text-1-13">
<ul class="org-ul">
<li>signify
<ul class="org-ul">
<li>cryptographic signature tools used to author releases and verify patches, very simple</li>
</ul></li>
<li>mandoc toolchain
<ul class="org-ul">
<li>Manpage utilities</li>
</ul></li>
<li>sndio
<ul class="org-ul">
<li>OpenBSD sound system. Very simple and flexible (f*ck pipewire &amp; pulseaudio)</li>
</ul></li>
<li>doas
<ul class="org-ul">
<li>A sane sudo, with a line of configuration to understand</li>
</ul></li>
<li>httpd, relayd
<ul class="org-ul">
<li>http server and http/tcp relay</li>
</ul></li>
<li>vmm/vmd
<ul class="org-ul">
<li>Homegrown virtual machines</li>
</ul></li>
<li>switchd
<ul class="org-ul">
<li>Software Defined Networking daemon, implements OpenFlow spec.</li>
</ul></li>
<li>rebound
<ul class="org-ul">
<li>DNS proxy</li>
</ul></li>
<li>unwind
<ul class="org-ul">
<li>Validating DNS resolver</li>
</ul></li>
<li>xenocara
<ul class="org-ul">
<li>Fork of X11</li>
</ul></li>
<li>acme-client
<ul class="org-ul">
<li>Client for LetsEncrypt's ACME service</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfe1816f" class="outline-3">
<h3 id="orgfe1816f"><span class="section-number-3">1.14</span> Networking Daemons</h3>
<div class="outline-text-3" id="text-1-14">
<ul class="org-ul">
<li>OpenSMTPD</li>
<li>OpenBGPD
<ul class="org-ul">
<li>RPKI-Client</li>
</ul></li>
<li>OpenNTPD</li>
<li>OpenIKED</li>
<li>CARP</li>
<li>DHCPd</li>
<li>DNS
<ul class="org-ul">
<li>Authoritative - nsd</li>
<li>Resolving - unbound</li>
</ul></li>
<li>FTPd</li>
<li>LDAP</li>
<li>HostAPd</li>
<li>NFS</li>
<li>OSPF</li>
<li>RADIUSs</li>
<li>RIPD</li>
<li>TFTPd</li>
<li>and more&#x2026;</li>
</ul>
</div>
</div>

<div id="outline-container-org1b7f750" class="outline-3">
<h3 id="org1b7f750"><span class="section-number-3">1.15</span> Use case considerations</h3>
<div class="outline-text-3" id="text-1-15">
<ul class="org-ul">
<li>Network edge</li>
<li>Mail servers</li>
<li>DNS server</li>
<li>BGP server</li>
<li>Secure Systems</li>
<li>Aythentication server</li>
<li>High risk environments</li>
<li>Places where correctness and predictability are important</li>
<li>Increased security causes a small performance hit</li>
<li>Multiprocessing kernel doesn't fully utilize multi-core processors</li>
<li>VMs are still experimental and not production ready, but getting there.</li>
</ul>
</div>
</div>

<div id="outline-container-org9a5573a" class="outline-3">
<h3 id="org9a5573a"><span class="section-number-3">1.16</span> man (1) Pages</h3>
<div class="outline-text-3" id="text-1-16">
<ul class="org-ul">
<li>Contain everything</li>
<li>apropos</li>
<li>man afterboot # and help</li>
<li>man hier</li>
<li>Manpage section: man &lt;#&gt; intro
<ul class="org-ul">
<li>Section 1 - General Commands</li>
<li>Section 2 - System calls</li>
<li>Section 3 - C library function</li>
<li>Section 4 - Device drivers</li>
<li>Section 5 - File Formats</li>
<li>Section 6 - Games</li>
<li>Section 7 - Miscellaneous</li>
<li>Section 8 - System Management</li>
<li>Section 9 - Kernel Development</li>
</ul></li>
</ul>
</div>
</div>
