openbsd-cheatsheet.org
** Filesystem hierarchy
- =/bsd=    - The kernel
- =/bsd.mp= - The multiprocessing kernel, if you're on a platform that supports it
- =/bsd.rd= - The ramdisk kernel, used for installation
- =/bin/=   - Statically-linked essential user tools
- =/sbin/=  - Statically-linked essential superuser tools
- =/etc/=   - Configuration files
- =/dev/=   - Device files
- =/home/=  - User home directories
- =/mnt/=   - Empty mount point
- =/root/=  - Root user home directory
- =/var/=   - Persistent non-user data: logs, mail, databases, websites, etc.
- =/usr/bin/=   - Most other user tools
- =/user/sbin/= - Most other superuser tools
- =/usr/{lib,include,share}=      - Program resources
- =/usr/local/{bin,lib,includes}= - All package provided files, except for configuration files (=/etc/=)

** User Management
- adduser  - Interactively add users
- chpass   - Interactively change user info
- useradd  - Non-interactively add users
- usermod  - Non-interactively modify user info
- userinfo - Get information on a user
- userdel  - Delete a user account

** syspatch (8)
- Dead simple to use
- Fast
- Really relyable, but if something goes wrong
  - Rollback the last patch with -r
  - Rollback all patches with -R

** rc (8)
- The command invoked by init (8)
- Very simple
- rcctl (8)
  - rcctl enable <daemon>  - Enable a daemon/service at boot
  - rcctl disable <daemon> - Disable a daemon/service at boot
  - rcctl get <daemon> - Get the configuration of a daemon
  - rcctl set <service> <variable> <args> - Set daemon variables
    - Examples:
      - rcctl set apmd flags -A
      - rcctl set dhcp user _dhcp
  - rcctl order [daemon] - Move daemon to the begining of the order
  - rcctl getdef <daemon> - Get default config of a daemon
  - rcctl ls <arg> - Display a list of services/daemons, one of:
    - rcctl ls all     - All services and daemons
    - rcctl ls failed  - All enabled but stopped daemons
    - rcctl ls on      - All enabled daemons
    - rcctl ls off     - All disabled daemons
    - rcctl ls started - All started daemons
    - rcctl ls stopped - All stopped daemons
  - rcctl [-df] <action> <daemon> - Pass a command to the rc.d script
    - rcctl [-f] start <daemon> - Start the daemon (-f start degardless of =daemon_flags=)
    - rcctl stop <daemon> - Stop the daemon
    - rcctl restart <daemon> - Restart the daemon
    - rcctl check <daemon> - Check if the daemon is running
- Split up into several parts:
  - /etc/rc - Startup command script
  - /etc/rc.conf - System daemon configuration database (don't touch)
  - /etc/rc.conf.local - System local configuration
  - /etc/rc/d - Location of rc/d (8) scripts
- rc.conf[.local]
  - =apmd_flags=NP= - Daemon disabled
  - =apmd_flags==   - Daemon enabled
  - =apmd_flags=-A= - Daemon enabled with special flags
- Special services (pf, ipsec, etc.) only hav a YES/NO option
  - =pf_enabled=YES=
- =pkg_scripts= - Services that have to startup and shutdown in order
  - Example: =pkg_scripts=messagebus cupsd=

** Logs
- Most logs are stores in /var/logs as you'd expect
  - Auth, pf, mail, daemons, etc.
  - httpd logs are stored in /var/www/logs

** Network Interfaces
- /etc/myname - Hostname
- /etc/mygateway - Static default gateway
  - Ingored by DHCP
- /etc/resolv.conf - Nameserver config
  - Overwritten by DHCP
- /etc/hostname.<if> where <if> is the name of the interface
- Enable DHCP on interface re0:
  - echo "dhcp" > /etc/hostname.re0
- Set static IP on t=interface re0:
  - echo "inet <ip addr? <subnet mask> NONE" > /etc/hostname.re0
  - echo "inet 192.168.2.23 255.255.255.0 NONE" > /etc/hostname.re0
- To auto-join a wireless network when it's around on iw0:
  - echo "join <NWID> wpakey <password>" > /etc/hostname.iw0
- man hostname.if
- man ifconfig
- Anything that doesn't match the configuration syntax is passed to ifconfig
  - Example: join Shopify wpakey NotThePassword
- Lines starting with a bang are run as commands
  - Example: !route add 10.0.5.0/24 10.0.1.1
- /etc/netstart - Network startup script, configures:
  - hostname
  - loopback
  - bridges
  - etc
- To re-apply a configuration to an interface: sh /etc/netstart <if>

** ifconfig (8)
- Used for all network configuration
- No ip/iwconfig/wpa_supplicant/vconfig/brctl/nmcli
- Join WiFi
#+BEGIN_SRC sh
  $ ifconfig iw0 join MySSID wpakey ThePassword
#+END_SRC
- Create vlan:
#+BEGIN_SRC sh
  $ ifconfig vlan5 create
  $ ifconfig vlan5 parent em1 192.168.5.1/24
#+END_SRC

** Package Management
- =pkg_add=         - Install packages
- =pkg_delete=      - Removed Packages
  - =pkg_delete -a= - Remove unused dependencies
- =pkg_info=        - Get package information
  - =pkg_info -Q=   - Search for packages

** OpenBSD Partitions
- Disks identified with DUID in /etc/fstab
- Disklabel partitions
  - Partition c is the whole disk
- Fast FileSystem (FFS)
  - Stable
  - Old
  - Updated frequently by the OpenBSD devs

** Commonly used commands
- ksh(1) - default shell
- sysctl (8) - manage kernel state
- usbdevs (8) - list usb devices
- pcidump (8) - list pci devices
- disklabel (8) - format OpenBSD disks
- sysctl hw.disknames - list disks
- vmstat (8) - check ram usage

** Window & Display Managers
- DWM  - The suckless dynamic window manager (less than 1000 lines of code)
- FVWM - Fully bloated, complicated to configure
- TWM  - Old crap
- More bloat:
  - Mate, gnome, lxqt
- Change default WM in $HOME/.xsession, or $HOME/.xinitrc
- Enable Xenodm (display manages)
  - rcctl enable xenodm
  - rcctl start xenodm

