html/openbsd-cheatsheet.html

<div id="outline-container-org1762914" class="outline-3">
<h3 id="org1762914"><span class="section-number-3">1.17</span> Filesystem hierarchy</h3>
<div class="outline-text-3" id="text-1-17">
<ul class="org-ul">
<li><code>/bsd</code>    - The kernel</li>
<li><code>/bsd.mp</code> - The multiprocessing kernel, if you're on a platform that supports it</li>
<li><code>/bsd.rd</code> - The ramdisk kernel, used for installation</li>
<li><code>/bin/</code>   - Statically-linked essential user tools</li>
<li><code>/sbin/</code>  - Statically-linked essential superuser tools</li>
<li><code>/etc/</code>   - Configuration files</li>
<li><code>/dev/</code>   - Device files</li>
<li><code>/home/</code>  - User home directories</li>
<li><code>/mnt/</code>   - Empty mount point</li>
<li><code>/root/</code>  - Root user home directory</li>
<li><code>/var/</code>   - Persistent non-user data: logs, mail, databases, websites, etc.</li>
<li><code>/usr/bin/</code>   - Most other user tools</li>
<li><code>/user/sbin/</code> - Most other superuser tools</li>
<li><code>/usr/{lib,include,share}</code>      - Program resources</li>
<li><code>/usr/local/{bin,lib,includes}</code> - All package provided files, except for configuration files (<code>/etc/</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-org9001049" class="outline-3">
<h3 id="org9001049"><span class="section-number-3">1.18</span> User Management</h3>
<div class="outline-text-3" id="text-1-18">
<ul class="org-ul">
<li>adduser  - Interactively add users</li>
<li>chpass   - Interactively change user info</li>
<li>useradd  - Non-interactively add users</li>
<li>usermod  - Non-interactively modify user info</li>
<li>userinfo - Get information on a user</li>
<li>userdel  - Delete a user account</li>
</ul>
</div>
</div>

<div id="outline-container-orga989dc3" class="outline-3">
<h3 id="orga989dc3"><span class="section-number-3">1.19</span> syspatch (8)</h3>
<div class="outline-text-3" id="text-1-19">
<ul class="org-ul">
<li>Dead simple to use</li>
<li>Fast</li>
<li>Really relyable, but if something goes wrong
<ul class="org-ul">
<li>Rollback the last patch with -r</li>
<li>Rollback all patches with -R</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb0505a7" class="outline-3">
<h3 id="orgb0505a7"><span class="section-number-3">1.20</span> rc (8)</h3>
<div class="outline-text-3" id="text-1-20">
<ul class="org-ul">
<li>The command invoked by init (8)</li>
<li>Very simple</li>
<li>rcctl (8)
<ul class="org-ul">
<li>rcctl enable &lt;daemon&gt;  - Enable a daemon/service at boot</li>
<li>rcctl disable &lt;daemon&gt; - Disable a daemon/service at boot</li>
<li>rcctl get &lt;daemon&gt; - Get the configuration of a daemon</li>
<li>rcctl set &lt;service&gt; &lt;variable&gt; &lt;args&gt; - Set daemon variables
<ul class="org-ul">
<li>Examples:
<ul class="org-ul">
<li>rcctl set apmd flags -A</li>
<li>rcctl set dhcp user _dhcp</li>
</ul></li>
</ul></li>
<li>rcctl order [daemon] - Move daemon to the begining of the order</li>
<li>rcctl getdef &lt;daemon&gt; - Get default config of a daemon</li>
<li>rcctl ls &lt;arg&gt; - Display a list of services/daemons, one of:
<ul class="org-ul">
<li>rcctl ls all     - All services and daemons</li>
<li>rcctl ls failed  - All enabled but stopped daemons</li>
<li>rcctl ls on      - All enabled daemons</li>
<li>rcctl ls off     - All disabled daemons</li>
<li>rcctl ls started - All started daemons</li>
<li>rcctl ls stopped - All stopped daemons</li>
</ul></li>
<li>rcctl [-df] &lt;action&gt; &lt;daemon&gt; - Pass a command to the rc.d script
<ul class="org-ul">
<li>rcctl [-f] start &lt;daemon&gt; - Start the daemon (-f start degardless of <code>daemon_flags</code>)</li>
<li>rcctl stop &lt;daemon&gt; - Stop the daemon</li>
<li>rcctl restart &lt;daemon&gt; - Restart the daemon</li>
<li>rcctl check &lt;daemon&gt; - Check if the daemon is running</li>
</ul></li>
</ul></li>
<li>Split up into several parts:
<ul class="org-ul">
<li>/etc/rc - Startup command script</li>
<li>/etc/rc.conf - System daemon configuration database (don't touch)</li>
<li>/etc/rc.conf.local - System local configuration</li>
<li>/etc/rc/d - Location of rc/d (8) scripts</li>
</ul></li>
<li>rc.conf[.local]
<ul class="org-ul">
<li><code>apmd_flags=NP</code> - Daemon disabled</li>
<li><code>apmd_flags=</code>   - Daemon enabled</li>
<li><code>apmd_flags</code>-A= - Daemon enabled with special flags</li>
</ul></li>
<li>Special services (pf, ipsec, etc.) only hav a YES/NO option
<ul class="org-ul">
<li><code>pf_enabled=YES</code></li>
</ul></li>
<li><code>pkg_scripts</code> - Services that have to startup and shutdown in order
<ul class="org-ul">
<li>Example: <code>pkg_scripts=messagebus cupsd</code></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1053bed" class="outline-3">
<h3 id="org1053bed"><span class="section-number-3">1.21</span> Logs</h3>
<div class="outline-text-3" id="text-1-21">
<ul class="org-ul">
<li>Most logs are stores in /var/logs as you'd expect
<ul class="org-ul">
<li>Auth, pf, mail, daemons, etc.</li>
<li>httpd logs are stored in /var/www/logs</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc532b67" class="outline-3">
<h3 id="orgc532b67"><span class="section-number-3">1.22</span> Network Interfaces</h3>
<div class="outline-text-3" id="text-1-22">
<ul class="org-ul">
<li>/etc/myname - Hostname</li>
<li>/etc/mygateway - Static default gateway
<ul class="org-ul">
<li>Ingored by DHCP</li>
</ul></li>
<li>/etc/resolv.conf - Nameserver config
<ul class="org-ul">
<li>Overwritten by DHCP</li>
</ul></li>
<li>/etc/hostname.&lt;if&gt; where &lt;if&gt; is the name of the interface</li>
<li>Enable DHCP on interface re0:
<ul class="org-ul">
<li>echo "dhcp" &gt; /etc/hostname.re0</li>
</ul></li>
<li>Set static IP on t=interface re0:
<ul class="org-ul">
<li>echo "inet &lt;ip addr? &lt;subnet mask&gt; NONE" &gt; /etc/hostname.re0</li>
<li>echo "inet 192.168.2.23 255.255.255.0 NONE" &gt; /etc/hostname.re0</li>
</ul></li>
<li>To auto-join a wireless network when it's around on iw0:
<ul class="org-ul">
<li>echo "join &lt;NWID&gt; wpakey &lt;password&gt;" &gt; /etc/hostname.iw0</li>
</ul></li>
<li>man hostname.if</li>
<li>man ifconfig</li>
<li>Anything that doesn't match the configuration syntax is passed to ifconfig
<ul class="org-ul">
<li>Example: join Shopify wpakey NotThePassword</li>
</ul></li>
<li>Lines starting with a bang are run as commands
<ul class="org-ul">
<li>Example: !route add 10.0.5.0/24 10.0.1.1</li>
</ul></li>
<li>/etc/netstart - Network startup script, configures:
<ul class="org-ul">
<li>hostname</li>
<li>loopback</li>
<li>bridges</li>
<li>etc</li>
</ul></li>
<li>To re-apply a configuration to an interface: sh /etc/netstart &lt;if&gt;</li>
</ul>
</div>
</div>

<div id="outline-container-orgd41875b" class="outline-3">
<h3 id="orgd41875b"><span class="section-number-3">1.23</span> ifconfig (8)</h3>
<div class="outline-text-3" id="text-1-23">
<ul class="org-ul">
<li>Used for all network configuration</li>
<li>No ip/iwconfig/wpa<sub>supplicant</sub>/vconfig/brctl/nmcli</li>
<li>Join WiFi</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">$ ifconfig iw0 join MySSID wpakey ThePassword
</pre>
</div>
<ul class="org-ul">
<li>Create vlan:</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">$ ifconfig vlan5 create
$ ifconfig vlan5 parent em1 192.168.5.1/24
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb479668" class="outline-3">
<h3 id="orgb479668"><span class="section-number-3">1.24</span> Package Management</h3>
<div class="outline-text-3" id="text-1-24">
<ul class="org-ul">
<li><code>pkg_add</code>         - Install packages</li>
<li><code>pkg_delete</code>      - Removed Packages
<ul class="org-ul">
<li><code>pkg_delete -a</code> - Remove unused dependencies</li>
</ul></li>
<li><code>pkg_info</code>        - Get package information
<ul class="org-ul">
<li><code>pkg_info -Q</code>   - Search for packages</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1ccbd69" class="outline-3">
<h3 id="org1ccbd69"><span class="section-number-3">1.25</span> OpenBSD Partitions</h3>
<div class="outline-text-3" id="text-1-25">
<ul class="org-ul">
<li>Disks identified with DUID in /etc/fstab</li>
<li>Disklabel partitions
<ul class="org-ul">
<li>Partition c is the whole disk</li>
</ul></li>
<li>Fast FileSystem (FFS)
<ul class="org-ul">
<li>Stable</li>
<li>Old</li>
<li>Updated frequently by the OpenBSD devs</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6484641" class="outline-3">
<h3 id="org6484641"><span class="section-number-3">1.26</span> Commonly used commands</h3>
<div class="outline-text-3" id="text-1-26">
<ul class="org-ul">
<li>ksh(1) - default shell</li>
<li>sysctl (8) - manage kernel state</li>
<li>usbdevs (8) - list usb devices</li>
<li>pcidump (8) - list pci devices</li>
<li>disklabel (8) - format OpenBSD disks</li>
<li>sysctl hw.disknames - list disks</li>
<li>vmstat (8) - check ram usage</li>
</ul>
</div>
</div>

<div id="outline-container-org74d7649" class="outline-3">
<h3 id="org74d7649"><span class="section-number-3">1.27</span> Window &amp; Display Managers</h3>
<div class="outline-text-3" id="text-1-27">
<ul class="org-ul">
<li>DWM  - The suckless dynamic window manager (less than 1000 lines of code)</li>
<li>FVWM - Fully bloated, complicated to configure</li>
<li>TWM  - Old crap</li>
<li>More bloat:
<ul class="org-ul">
<li>Mate, gnome, lxqt</li>
</ul></li>
<li>Change default WM in $HOME/.xsession, or $HOME/.xinitrc</li>
<li>Enable Xenodm (display manages)
<ul class="org-ul">
<li>rcctl enable xenodm</li>
<li>rcctl start xenodm</li>
</ul></li>
</ul>
</div>
</div>
