openbsd-cheatsheet.org
** Resources
1. Youtube ([[https://youtube.com/watch?v=EkDVKthufAM][?v=EkDVKthufAM]])
2. [[https://man.openbsd.org]]
3. [[https://www.openbsd.org/mail.html][Mailing List]]
4. [[https://undeadly.org][OpenBSD Journal]]
5. [[https://bronevichok.ru/openbsdnow/][Planet OpenBSD]]
6. [[https://github.com/ligurio/awesome-openbsd][Awesome-openbsd]]
7. [[https://blog.lambda.cx][Post]]

----------------------------------------------------------------------

* The OpenBSD Web Stack

** The Software Life Circle
#+BEGIN_EXAMPLE
Alice - "I made a simple tool!"
Bob   - "It's a great tool! Here's a feature."
Cal   - "Here's more features!"
Dale  - feature, feature, feature, feature
World - "bloatware, ughh"
Annie - "I made a simple tool!" :)
#+END_EXAMPLE

** OpenBSD vs the Software Cyrcle
- OpenBSD stands athwart the software feature cyrcle, shouting "Stop!"
- Simple tools that do one job well
- Read "Features are Faults" by Yed Uangst

** Web Stack Components
- httpd web server
- relayd proxy and redirector
- CARP IP-layer redundancy
- PF packet filter
- LibreSSL

** LibreSSL & PF
- All writtento LibreSSL APIs, not OpenSSL
- Hooks into PF
- No LibreSSL or PF, no httpd/relayd
- Platforms:
  - OpenBSD
  - FreeBSD w/LibreSSL like TrueOS or HardenedBSD
  - FreeBSD with custom packages

** httpd
- Simple web server
- Config syntax remoniscent of nginx & other OpenBSD programs
- Chrooted into /var/www
- /etc/httpd.conf
- FastCGI

** Httpd.conf
#+BEGIN_EXAMPLE
public_ip="192.0.2.101"

server "www.manosvasilakis.gr" {
	include "/etc.httpd-global.conf"
	alias "manosvasilakis.gr"
	listen on $public_ip port 80
	root "/manosvasilakis.gr"
}
#+END_EXAMPLE

** Per-Location Rules
#+BEGIN_EXAMPLE
server "www.manosvasilakis.gr" {
	...
	directory auto index
	location "/files/" {
		directory no auto index
	}
	location "/secret/*" {
		authenticate "Nope!" with "/htpasswords"
	}
}
#+END_EXAMPLE

** Default Server
- Listens on all IPs
- Client pokes at IP without providing a hostname,
  get the default
- /var/www/htdocs

** Blocks and Redirects
#+BEGIN_EXAMPLE
...
location "/rss.xml" {
	block return 302 "index/cgi?rss=1"
}

server "www.manosvasilakis.gr" {
	listen on $public_ipb port 80
	block return 301 "https://$SERVER_NAME$REQUEST_URI"
}
#+END_EXAMPLE

** Globs
- Shell globs in httpd.conf
#+BEGIN_EXAMPLE
server "www?.manosvasilakis.gr" {
	alias "www.manosvasilakis.gr"
	listen on $public_ip6 port 80
	root "/www1"
}
#+END_EXAMPLE

** Wildcards & Classes
#+BEGIN_EXAMPLE
server "*.manosvasilakis.gr" {
	alias manosvasilakis.gr
	listen on $public_ip6 port 80
	root "/www1"
}
server "[ab1][cd2].manosvasilakis.gr" {
}
#+END_EXAMPLE


** Perl Regexes
- Nightmarishly complicated
- Convoluted to use
- Impossible to verify in code
- Most of use use only a tiny part of them
- OpenBSD: Nope!

** Lua Patterns
- Lots of regex-style functionality
- Much smaller
- Much simpler
- Much less maddening
- Look like globs
- Identify patterns with "match" keyword

** Lua Character Classes
- period (.) = any possible character
- %a = all letters
- %d = all digits
- %g = all printable characters except spaces
- %l = all lowercase letters
- %u = all upercase letters
- %w = all alphanumeric characters

** Custom Lua Classes
- Put classes in brackets:
  - [a-p,r-z] - all lowercase letters but q
  - [%a%d] - all letters, all digits

** Multiples
- W* -> 0 or more Ws
- W+ -> 1 or more Ws
- * and + -> match longest possible strings
- ^ -> anchor to front of string
- $ -> anchor to end of string

** Httpd Logs
- Defaults to traditional Apache log format
#+BEGIN_EXAMPLE
server mwl.io {
	log style combined
	log access mwl/mwl_access
	log error mwl/mwl_err
	...
}
#+END_EXAMPLE

** Httpd Debugging
- Test configuration before restarting
#+BEGIN_EXAMPLE
  # httpd -n
#+END_EXAMPLE
- Check test config
#+BEGIN_EXAMPLE
  # httpd -nf /etc/httpd-test.conf
#+END_EXAMPLE
- Run in foreground
#+BEGIN_EXAMPLE
  # httpd -dvvv
#+END_EXAMPLE

** Dynamic Content
- Uses FastCGI interface with slowcgi(8)
- 500 errors? showcgi not running
#+BEGIN_EXAMPLE
server "bgp.manosvasilakis.gr {
	listen on * port 80
	location "/cgi-bin/*" {
		root "/"
		fastcgi
	}
}
#+END_EXAMPLE

** Httpd Chroot
- Plus side: the webserver can only access stuff in /var/www
- Down side: the webserver can only access stuff in /var/www
- /var/www/etc/hosts, resolv.conf, locatime
- No Symlinks
- ldd(1) to identify shared libraries

** Sample App: Wordpress
- If WordPress runs, anything runs!
- MariaDB instead of MySQL
- Choose PHP version
- rc.conf:
#+BEGIN_EXAMPLE
  httpd_flags=""
  pkg_scripts="mysqld php70_fpm"
#+END_EXAMPLE


** MariaDB socket in chroot
#+BEGIN_EXAMPLE
# mkdir -p /var/www/var/run/mysql
# chown _mysql:_mysql /var/www/var/run/mysql
#+END_EXAMPLE

- /etc/my.cnf
#+BEGIN_EXAMPLE
[client]
socket = /var/www/var/run/mysql/mysql.sock
[mysqld]
socket = /var/www/var/run/mysql/mysql.sock
#+END_EXAMPLE


