html/openbsd-cheatsheet.html

<div id="outline-container-org8e0ab2f" class="outline-3">
<h3 id="org8e0ab2f"><span class="section-number-3">1.28</span> Resources</h3>
<div class="outline-text-3" id="text-1-28">
<ol class="org-ol">
<li>Youtube (<a href="https://youtube.com/watch?v=EkDVKthufAM">?v=EkDVKthufAM</a>)</li>
<li><a href="https://man.openbsd.org">https://man.openbsd.org</a></li>
<li><a href="https://www.openbsd.org/mail.html">Mailing List</a></li>
<li><a href="https://undeadly.org">OpenBSD Journal</a></li>
<li><a href="https://bronevichok.ru/openbsdnow/">Planet OpenBSD</a></li>
<li><a href="https://github.com/ligurio/awesome-openbsd">Awesome-openbsd</a></li>
<li><a href="https://blog.lambda.cx">Post</a></li>
</ol>

<hr />
</div>
</div>
</div>

<div id="outline-container-org6330259" class="outline-2">
<h2 id="org6330259"><span class="section-number-2">2</span> The OpenBSD Web Stack</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6217634" class="outline-3">
<h3 id="org6217634"><span class="section-number-3">2.1</span> The Software Life Circle</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example" id="orgb447b44">
Alice - "I made a simple tool!"
Bob   - "It's a great tool! Here's a feature."
Cal   - "Here's more features!"
Dale  - feature, feature, feature, feature
World - "bloatware, ughh"
Annie - "I made a simple tool!" :)
</pre>
</div>
</div>

<div id="outline-container-org098db9c" class="outline-3">
<h3 id="org098db9c"><span class="section-number-3">2.2</span> OpenBSD vs the Software Cyrcle</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>OpenBSD stands athwart the software feature cyrcle, shouting "Stop!"</li>
<li>Simple tools that do one job well</li>
<li>Read "Features are Faults" by Yed Uangst</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa741d6" class="outline-3">
<h3 id="orgfa741d6"><span class="section-number-3">2.3</span> Web Stack Components</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>httpd web server</li>
<li>relayd proxy and redirector</li>
<li>CARP IP-layer redundancy</li>
<li>PF packet filter</li>
<li>LibreSSL</li>
</ul>
</div>
</div>

<div id="outline-container-org84bcf98" class="outline-3">
<h3 id="org84bcf98"><span class="section-number-3">2.4</span> LibreSSL &amp; PF</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>All writtento LibreSSL APIs, not OpenSSL</li>
<li>Hooks into PF</li>
<li>No LibreSSL or PF, no httpd/relayd</li>
<li>Platforms:
<ul class="org-ul">
<li>OpenBSD</li>
<li>FreeBSD w/LibreSSL like TrueOS or HardenedBSD</li>
<li>FreeBSD with custom packages</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6b30615" class="outline-3">
<h3 id="org6b30615"><span class="section-number-3">2.5</span> httpd</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Simple web server</li>
<li>Config syntax remoniscent of nginx &amp; other OpenBSD programs</li>
<li>Chrooted into /var/www</li>
<li>/etc/httpd.conf</li>
<li>FastCGI</li>
</ul>
</div>
</div>

<div id="outline-container-orgd83bc6a" class="outline-3">
<h3 id="orgd83bc6a"><span class="section-number-3">2.6</span> Httpd.conf</h3>
<div class="outline-text-3" id="text-2-6">
<pre class="example" id="org0a6fc9b">
public_ip="192.0.2.101"

server "www.manosvasilakis.gr" {
	include "/etc.httpd-global.conf"
	alias "manosvasilakis.gr"
	listen on $public_ip port 80
	root "/manosvasilakis.gr"
}
</pre>
</div>
</div>

<div id="outline-container-org59707c7" class="outline-3">
<h3 id="org59707c7"><span class="section-number-3">2.7</span> Per-Location Rules</h3>
<div class="outline-text-3" id="text-2-7">
<pre class="example" id="org54cb25f">
server "www.manosvasilakis.gr" {
	...
	directory auto index
	location "/files/" {
		directory no auto index
	}
	location "/secret/*" {
		authenticate "Nope!" with "/htpasswords"
	}
}
</pre>
</div>
</div>

<div id="outline-container-org9893dd9" class="outline-3">
<h3 id="org9893dd9"><span class="section-number-3">2.8</span> Default Server</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li>Listens on all IPs</li>
<li>Client pokes at IP without providing a hostname,
get the default</li>
<li>/var/www/htdocs</li>
</ul>
</div>
</div>

<div id="outline-container-orgdd85b43" class="outline-3">
<h3 id="orgdd85b43"><span class="section-number-3">2.9</span> Blocks and Redirects</h3>
<div class="outline-text-3" id="text-2-9">
<pre class="example" id="orge22e73b">
...
location "/rss.xml" {
	block return 302 "index/cgi?rss=1"
}

server "www.manosvasilakis.gr" {
	listen on $public_ipb port 80
	block return 301 "https://$SERVER_NAME$REQUEST_URI"
}
</pre>
</div>
</div>

<div id="outline-container-org217df6d" class="outline-3">
<h3 id="org217df6d"><span class="section-number-3">2.10</span> Globs</h3>
<div class="outline-text-3" id="text-2-10">
<ul class="org-ul">
<li>Shell globs in httpd.conf</li>
</ul>
<pre class="example" id="orgd268303">
server "www?.manosvasilakis.gr" {
	alias "www.manosvasilakis.gr"
	listen on $public_ip6 port 80
	root "/www1"
}
</pre>
</div>
</div>

<div id="outline-container-org5cbdd3b" class="outline-3">
<h3 id="org5cbdd3b"><span class="section-number-3">2.11</span> Wildcards &amp; Classes</h3>
<div class="outline-text-3" id="text-2-11">
<pre class="example" id="orga19bf65">
server "*.manosvasilakis.gr" {
	alias manosvasilakis.gr
	listen on $public_ip6 port 80
	root "/www1"
}
server "[ab1][cd2].manosvasilakis.gr" {
}
</pre>
</div>
</div>


<div id="outline-container-org9c8b7a5" class="outline-3">
<h3 id="org9c8b7a5"><span class="section-number-3">2.12</span> Perl Regexes</h3>
<div class="outline-text-3" id="text-2-12">
<ul class="org-ul">
<li>Nightmarishly complicated</li>
<li>Convoluted to use</li>
<li>Impossible to verify in code</li>
<li>Most of use use only a tiny part of them</li>
<li>OpenBSD: Nope!</li>
</ul>
</div>
</div>

<div id="outline-container-orgf5f22dc" class="outline-3">
<h3 id="orgf5f22dc"><span class="section-number-3">2.13</span> Lua Patterns</h3>
<div class="outline-text-3" id="text-2-13">
<ul class="org-ul">
<li>Lots of regex-style functionality</li>
<li>Much smaller</li>
<li>Much simpler</li>
<li>Much less maddening</li>
<li>Look like globs</li>
<li>Identify patterns with "match" keyword</li>
</ul>
</div>
</div>

<div id="outline-container-org4466f53" class="outline-3">
<h3 id="org4466f53"><span class="section-number-3">2.14</span> Lua Character Classes</h3>
<div class="outline-text-3" id="text-2-14">
<ul class="org-ul">
<li>period (.) = any possible character</li>
<li>%a = all letters</li>
<li>%d = all digits</li>
<li>%g = all printable characters except spaces</li>
<li>%l = all lowercase letters</li>
<li>%u = all upercase letters</li>
<li>%w = all alphanumeric characters</li>
</ul>
</div>
</div>

<div id="outline-container-org47bbc3b" class="outline-3">
<h3 id="org47bbc3b"><span class="section-number-3">2.15</span> Custom Lua Classes</h3>
<div class="outline-text-3" id="text-2-15">
<ul class="org-ul">
<li>Put classes in brackets:
<ul class="org-ul">
<li>[a-p,r-z] - all lowercase letters but q</li>
<li>[%a%d] - all letters, all digits</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7b7b37c" class="outline-3">
<h3 id="org7b7b37c"><span class="section-number-3">2.16</span> Multiples</h3>
<div class="outline-text-3" id="text-2-16">
<ul class="org-ul">
<li>W* -&gt; 0 or more Ws</li>
<li>W+ -&gt; 1 or more Ws</li>
<li>* and + -&gt; match longest possible strings</li>
<li>^ -&gt; anchor to front of string</li>
<li>$ -&gt; anchor to end of string</li>
</ul>
</div>
</div>

<div id="outline-container-org71b476b" class="outline-3">
<h3 id="org71b476b"><span class="section-number-3">2.17</span> Httpd Logs</h3>
<div class="outline-text-3" id="text-2-17">
<ul class="org-ul">
<li>Defaults to traditional Apache log format</li>
</ul>
<pre class="example" id="org87339ff">
server mwl.io {
	log style combined
	log access mwl/mwl_access
	log error mwl/mwl_err
	...
}
</pre>
</div>
</div>

<div id="outline-container-org3621cfe" class="outline-3">
<h3 id="org3621cfe"><span class="section-number-3">2.18</span> Httpd Debugging</h3>
<div class="outline-text-3" id="text-2-18">
<ul class="org-ul">
<li>Test configuration before restarting</li>
</ul>
<pre class="example" id="org9f778db">
# httpd -n
</pre>
<ul class="org-ul">
<li>Check test config</li>
</ul>
<pre class="example" id="orgfcf0d9f">
# httpd -nf /etc/httpd-test.conf
</pre>
<ul class="org-ul">
<li>Run in foreground</li>
</ul>
<pre class="example" id="org888dd5f">
# httpd -dvvv
</pre>
</div>
</div>

<div id="outline-container-org5a65236" class="outline-3">
<h3 id="org5a65236"><span class="section-number-3">2.19</span> Dynamic Content</h3>
<div class="outline-text-3" id="text-2-19">
<ul class="org-ul">
<li>Uses FastCGI interface with slowcgi(8)</li>
<li>500 errors? showcgi not running</li>
</ul>
<pre class="example" id="org47cb95d">
server "bgp.manosvasilakis.gr {
	listen on * port 80
	location "/cgi-bin/*" {
		root "/"
		fastcgi
	}
}
</pre>
</div>
</div>

<div id="outline-container-org32e517d" class="outline-3">
<h3 id="org32e517d"><span class="section-number-3">2.20</span> Httpd Chroot</h3>
<div class="outline-text-3" id="text-2-20">
<ul class="org-ul">
<li>Plus side: the webserver can only access stuff in /var/www</li>
<li>Down side: the webserver can only access stuff in /var/www</li>
<li>/var/www/etc/hosts, resolv.conf, locatime</li>
<li>No Symlinks</li>
<li>ldd(1) to identify shared libraries</li>
</ul>
</div>
</div>

<div id="outline-container-org54f400f" class="outline-3">
<h3 id="org54f400f"><span class="section-number-3">2.21</span> Sample App: Wordpress</h3>
<div class="outline-text-3" id="text-2-21">
<ul class="org-ul">
<li>If WordPress runs, anything runs!</li>
<li>MariaDB instead of MySQL</li>
<li>Choose PHP version</li>
<li>rc.conf:</li>
</ul>
<pre class="example" id="org5b52f81">
httpd_flags=""
pkg_scripts="mysqld php70_fpm"
</pre>
</div>
</div>


<div id="outline-container-org80c9d75" class="outline-3">
<h3 id="org80c9d75"><span class="section-number-3">2.22</span> MariaDB socket in chroot</h3>
<div class="outline-text-3" id="text-2-22">
<pre class="example" id="orge956fee">
# mkdir -p /var/www/var/run/mysql
# chown _mysql:_mysql /var/www/var/run/mysql
</pre>

<ul class="org-ul">
<li>/etc/my.cnf</li>
</ul>
<pre class="example" id="org00aaec0">
[client]
socket = /var/www/var/run/mysql/mysql.sock
[mysqld]
socket = /var/www/var/run/mysql/mysql.sock
</pre>
</div>
</div>
