openbsd-cheatsheet.org
** Configure PHP Modules
#+BEGIN_EXAMPLE
# cd /etc/php-7.0
# cp ../php-7.0.sample/* .
# rcctl start php70_fpm
#+END_EXAMPLE

** httpd.conf
#+BEGIN_EXAMPLE
server "blog.manosvasilakis.gr" {
	listen on * port 80
	directory index index.php
	location "*.php" {
		fastcgi socket "/run/php-fpm.sock"
	}
}
#+END_EXAMPLE

** TLS
- Transport Layer Security
- Replaces SSL
- Only protects data in transit
- Verifies control of DNS
- Does not verify identity
- Certificate Authority based
  - CAs suck

** Let's Encrypt
- Scripted automated certificate authority
- Free SSL certs all around!
- Work by verifying domain control, such as DNS entries or HTTP entries.
- Automated Certificate Management Environment (ACME)
- OpenBSD's acme-client(1) automates cert renewal
- Good for 90 days, must be automate renewal

** How ACME Works
- Initial client run: creates account keypair
- Client asks ACME CA what proof it will accept
  - LE accepts HTTP and DNS auth
  - Client chooses with proof it wants to offer
  - acme-client users HTTP
- acme-client creates CSR
- ACME CA say "create this HTTP file on server"
- acme-client creates file and signs it
- ACME CA checks for file
- If file exists, signs and retuns the cert

** Configuring httpd for ACME
#+BEGIN_EXAMPLE
server "www.manosvasilakis.gr" {
	...
	location "/.well-known/acme- challenge/*" {
		root "/acme"
		root strip 2
		no auto index
	}
}
domain www.manosvasilakis.gr {
	alternative names {
		manosvasilakis.gr api.manosvasilakis.gr
	}
	domain key "/etc/ssl/acme/manosvasilakis/manosvasilakis.key"
	domain certificate "/etc/ssl/acme/manosvasilakis/manosvasilakis.crt"
	domain chain certificate
		"/etc/ssl/acme/manosvasilakis/manosvasilakis.chain.pem"
	domain full chain certificate
		"/etc/ssl/acme/manosvasilakis/manosvasilakis.fullchain.pem"
	sign with $le		
}
#+END_EXAMPLE

** First acme-client run
- Create authority account key
#+BEGIN_EXAMPLE
  # acme-client -A
#+END_EXAMPLE
- Get cert
#+BEGIN_EXAMPLE
  # acme-client -vvD www.manosvasilakis.gr
#+END_EXAMPLE
- Read -v output, learn things :)

** TLS in httpd.conf
#+BEGIN_EXAMPLE
server "www.manosvasilakis.gr" {
	listen on * port 80
	block return 301 "https://$SERVER$REQUEST_URI"
}
server "www.manosvasilakis.gr" {
	alias manosvasilakis.gr
	listen on * tls port 443
	tls certificate
		"/etc/ssl/acme/manosvasilakis/manosvasilakis.fullchain.pem"
	tls key "/etc/ssl/acme/manosvasilakis/manosvasilakis.key"
	hsts
	...
}
#+END_EXAMPLE

** Renew ACME Certs
#+BEGIN_SRC sh
#!/bin/sh
acme-client www.manosvasilakis.gr
if [ $? -eq 0 ]
	then
	/etc/rc.d/httpd reload
fi
#+END_SRC


Online Certificate Status Protocol
- Doesn't worth ur time for small websites
- Provides a speed up in cert validation
- Verifies certificate hasn't been revoked in the last 7 days
#+BEGIN_SRC sh
cd /etc/ssl/acme/www
ocspcheck -No www.der www.fullchain.pem
#+END_SRC
#+BEGIN_EXAMPLE
server "www.manosvasilakis.gr" {
	tls certificate
		"/etc/ssl/acme/www/www.fullchain.pem"
	tls key "/etc/ssl/adme/www/www.key"
	tls ocsp "/etc/ssl/acme/www/www.der"
}
#+END_EXAMPLE

** Maintain OCSP
- Certificates expire weekly
#+BEGIN_SRC sh
#!/bin/sh
acme-client -v www.manosvasilakis.gr
ocspcheck -vN -o /etc/ssh/acme/manosvasilakis/manosvasilakis.der
	/etc/ssl/acme/manosvasilakis/manosvasilakis.fullchain.pem
if [ $? == 0 ]
	then
	/etc/rc.d/httpd reload
fi
#+END_SRC

** More Httpd Bits
The Internet is stupid and sometimes you have to...
- Change site's TCP behavior in httpd.conf
- Set IP TTL
- Change TLS versions & ciphers
- Users with websites? Home dirs under /var/www


** Relayd
- PF can redirect traffic to hosts inside firewall
- Relayd tests hosts to see if they should receive traffic
  and adjusts PF tables appropriately
- Relayd can act as layer 7 proxy: accept connection,
  muck with them, connect onward.
- Start with a PF firewall: packet forwarding, inside can't
  connect to firewall itself, etc

** Relayd Components
- Relayd daemon - runs checks
  - Parent process
  - Host Check Engine
  - PF Engine
  - Relay Engine
- relayctl(8) - manages relayd

** Redirections
- Pure TCP/IP load balancing
#+BEGIN_EXAMPLE
table <www> {192.0.2.101 192.0.2.102}
redirect www {
	listen on $ext_addr port 90 interface en0
	forward to <www> check http "/" code 200
}
#+END_EXAMPLE

** Macros (like any other OpenBSD program)
#+BEGIN_EXAMPLE
www1="192.0.2.101"
www2="192.0.2.102"
ext_ip="203.0.113.213"

table <www> {$www1 $www2}
redirect www {
	listen on $ext_ip port 80 interface em0
	forward to <www> check http "/" code 200
}
#+END_EXAMPLE

** relayctl(8)
#+BEGIN_EXAMPLE
# relayctl show summary

id  Type      Name         Avlbltu  Status
1   redirect  www                   active
1   table     www:80                active (2 hosts)
1   host      192.0.2.101  100.00%  up
2   host      192.0.2.102  100.00%  up
#+END_EXAMPLE

** Host Checks
- ICMP checks
- TCP port test
- HTTP response code check
- TLS check
- HTTP response code over TLS check
- File integrity check

