html/openbsd-cheatsheet.html


<div id="outline-container-org95e8a6d" class="outline-3">
<h3 id="org95e8a6d"><span class="section-number-3">2.23</span> Configure PHP Modules</h3>
<div class="outline-text-3" id="text-2-23">
<pre class="example" id="org8539770">
# cd /etc/php-7.0
# cp ../php-7.0.sample/* .
# rcctl start php70_fpm
</pre>
</div>
</div>

<div id="outline-container-orged4ca78" class="outline-3">
<h3 id="orged4ca78"><span class="section-number-3">2.24</span> httpd.conf</h3>
<div class="outline-text-3" id="text-2-24">
<pre class="example" id="org2d5d74b">
server "blog.manosvasilakis.gr" {
	listen on * port 80
	directory index index.php
	location "*.php" {
		fastcgi socket "/run/php-fpm.sock"
	}
}
</pre>
</div>
</div>

<div id="outline-container-org0a03f86" class="outline-3">
<h3 id="org0a03f86"><span class="section-number-3">2.25</span> TLS</h3>
<div class="outline-text-3" id="text-2-25">
<ul class="org-ul">
<li>Transport Layer Security</li>
<li>Replaces SSL</li>
<li>Only protects data in transit</li>
<li>Verifies control of DNS</li>
<li>Does not verify identity</li>
<li>Certificate Authority based
<ul class="org-ul">
<li>CAs suck</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org37198b8" class="outline-3">
<h3 id="org37198b8"><span class="section-number-3">2.26</span> Let's Encrypt</h3>
<div class="outline-text-3" id="text-2-26">
<ul class="org-ul">
<li>Scripted automated certificate authority</li>
<li>Free SSL certs all around!</li>
<li>Work by verifying domain control, such as DNS entries or HTTP entries.</li>
<li>Automated Certificate Management Environment (ACME)</li>
<li>OpenBSD's acme-client(1) automates cert renewal</li>
<li>Good for 90 days, must be automate renewal</li>
</ul>
</div>
</div>

<div id="outline-container-org3232df1" class="outline-3">
<h3 id="org3232df1"><span class="section-number-3">2.27</span> How ACME Works</h3>
<div class="outline-text-3" id="text-2-27">
<ul class="org-ul">
<li>Initial client run: creates account keypair</li>
<li>Client asks ACME CA what proof it will accept
<ul class="org-ul">
<li>LE accepts HTTP and DNS auth</li>
<li>Client chooses with proof it wants to offer</li>
<li>acme-client users HTTP</li>
</ul></li>
<li>acme-client creates CSR</li>
<li>ACME CA say "create this HTTP file on server"</li>
<li>acme-client creates file and signs it</li>
<li>ACME CA checks for file</li>
<li>If file exists, signs and retuns the cert</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8485b6" class="outline-3">
<h3 id="orgb8485b6"><span class="section-number-3">2.28</span> Configuring httpd for ACME</h3>
<div class="outline-text-3" id="text-2-28">
<pre class="example" id="org3600c39">
server "www.manosvasilakis.gr" {
	...
	location "/.well-known/acme- challenge/*" {
		root "/acme"
		root strip 2
		no auto index
	}
}
domain www.manosvasilakis.gr {
	alternative names {
		manosvasilakis.gr api.manosvasilakis.gr
	}
	domain key "/etc/ssl/acme/manosvasilakis/manosvasilakis.key"
	domain certificate "/etc/ssl/acme/manosvasilakis/manosvasilakis.crt"
	domain chain certificate
		"/etc/ssl/acme/manosvasilakis/manosvasilakis.chain.pem"
	domain full chain certificate
		"/etc/ssl/acme/manosvasilakis/manosvasilakis.fullchain.pem"
	sign with $le		
}
</pre>
</div>
</div>

<div id="outline-container-org2cc50d3" class="outline-3">
<h3 id="org2cc50d3"><span class="section-number-3">2.29</span> First acme-client run</h3>
<div class="outline-text-3" id="text-2-29">
<ul class="org-ul">
<li>Create authority account key</li>
</ul>
<pre class="example" id="org8eabe53">
# acme-client -A
</pre>
<ul class="org-ul">
<li>Get cert</li>
</ul>
<pre class="example" id="org02ce989">
# acme-client -vvD www.manosvasilakis.gr
</pre>
<ul class="org-ul">
<li>Read -v output, learn things :)</li>
</ul>
</div>
</div>

<div id="outline-container-org235ee3b" class="outline-3">
<h3 id="org235ee3b"><span class="section-number-3">2.30</span> TLS in httpd.conf</h3>
<div class="outline-text-3" id="text-2-30">
<pre class="example" id="org8ccbc52">
server "www.manosvasilakis.gr" {
	listen on * port 80
	block return 301 "https://$SERVER$REQUEST_URI"
}
server "www.manosvasilakis.gr" {
	alias manosvasilakis.gr
	listen on * tls port 443
	tls certificate
		"/etc/ssl/acme/manosvasilakis/manosvasilakis.fullchain.pem"
	tls key "/etc/ssl/acme/manosvasilakis/manosvasilakis.key"
	hsts
	...
}
</pre>
</div>
</div>

<div id="outline-container-org1109184" class="outline-3">
<h3 id="org1109184"><span class="section-number-3">2.31</span> Renew ACME Certs</h3>
<div class="outline-text-3" id="text-2-31">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #a89984;">#</span><span style="color: #a89984;">!/bin/</span><span style="color: #9d0006;">sh</span>
acme-client www.manosvasilakis.gr
<span style="color: #9d0006;">if</span> [ $<span style="color: #076678;">?</span> -eq 0 ]
    <span style="color: #9d0006;">then</span>
    /etc/rc.d/httpd reload
<span style="color: #9d0006;">fi</span>
</pre>
</div>


<p>
Online Certificate Status Protocol
</p>
<ul class="org-ul">
<li>Doesn't worth ur time for small websites</li>
<li>Provides a speed up in cert validation</li>
<li>Verifies certificate hasn't been revoked in the last 7 days</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #af3a03;">cd</span> /etc/ssl/acme/www
ocspcheck -No www.der www.fullchain.pem
</pre>
</div>
<pre class="example" id="org47c9c19">
server "www.manosvasilakis.gr" {
	tls certificate
		"/etc/ssl/acme/www/www.fullchain.pem"
	tls key "/etc/ssl/adme/www/www.key"
	tls ocsp "/etc/ssl/acme/www/www.der"
}
</pre>
</div>
</div>

<div id="outline-container-org2705fe3" class="outline-3">
<h3 id="org2705fe3"><span class="section-number-3">2.32</span> Maintain OCSP</h3>
<div class="outline-text-3" id="text-2-32">
<ul class="org-ul">
<li>Certificates expire weekly</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #a89984;">#</span><span style="color: #a89984;">!/bin/</span><span style="color: #9d0006;">sh</span>
acme-client -v www.manosvasilakis.gr
ocspcheck -vN -o /etc/ssh/acme/manosvasilakis/manosvasilakis.der
    /etc/ssl/acme/manosvasilakis/manosvasilakis.fullchain.pem
<span style="color: #9d0006;">if</span> [ $<span style="color: #076678;">?</span> == 0 ]
    <span style="color: #9d0006;">then</span>
    /etc/rc.d/httpd reload
<span style="color: #9d0006;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org52f0e90" class="outline-3">
<h3 id="org52f0e90"><span class="section-number-3">2.33</span> More Httpd Bits</h3>
<div class="outline-text-3" id="text-2-33">
<p>
The Internet is stupid and sometimes you have to&#x2026;
</p>
<ul class="org-ul">
<li>Change site's TCP behavior in httpd.conf</li>
<li>Set IP TTL</li>
<li>Change TLS versions &amp; ciphers</li>
<li>Users with websites? Home dirs under /var/www</li>
</ul>
</div>
</div>


<div id="outline-container-org21ebc78" class="outline-3">
<h3 id="org21ebc78"><span class="section-number-3">2.34</span> Relayd</h3>
<div class="outline-text-3" id="text-2-34">
<ul class="org-ul">
<li>PF can redirect traffic to hosts inside firewall</li>
<li>Relayd tests hosts to see if they should receive traffic
and adjusts PF tables appropriately</li>
<li>Relayd can act as layer 7 proxy: accept connection,
muck with them, connect onward.</li>
<li>Start with a PF firewall: packet forwarding, inside can't
connect to firewall itself, etc</li>
</ul>
</div>
</div>

<div id="outline-container-org9f38522" class="outline-3">
<h3 id="org9f38522"><span class="section-number-3">2.35</span> Relayd Components</h3>
<div class="outline-text-3" id="text-2-35">
<ul class="org-ul">
<li>Relayd daemon - runs checks
<ul class="org-ul">
<li>Parent process</li>
<li>Host Check Engine</li>
<li>PF Engine</li>
<li>Relay Engine</li>
</ul></li>
<li>relayctl(8) - manages relayd</li>
</ul>
</div>
</div>

<div id="outline-container-org2c93274" class="outline-3">
<h3 id="org2c93274"><span class="section-number-3">2.36</span> Redirections</h3>
<div class="outline-text-3" id="text-2-36">
<ul class="org-ul">
<li>Pure TCP/IP load balancing</li>
</ul>
<pre class="example" id="orge0258b1">
table &lt;www&gt; {192.0.2.101 192.0.2.102}
redirect www {
	listen on $ext_addr port 90 interface en0
	forward to &lt;www&gt; check http "/" code 200
}
</pre>
</div>
</div>

<div id="outline-container-org63eca13" class="outline-3">
<h3 id="org63eca13"><span class="section-number-3">2.37</span> Macros (like any other OpenBSD program)</h3>
<div class="outline-text-3" id="text-2-37">
<pre class="example" id="orge71f4c5">
www1="192.0.2.101"
www2="192.0.2.102"
ext_ip="203.0.113.213"

table &lt;www&gt; {$www1 $www2}
redirect www {
	listen on $ext_ip port 80 interface em0
	forward to &lt;www&gt; check http "/" code 200
}
</pre>
</div>
</div>

<div id="outline-container-orgf2d0ed9" class="outline-3">
<h3 id="orgf2d0ed9"><span class="section-number-3">2.38</span> relayctl(8)</h3>
<div class="outline-text-3" id="text-2-38">
<pre class="example" id="org3b241ae">
# relayctl show summary

id  Type      Name         Avlbltu  Status
1   redirect  www                   active
1   table     www:80                active (2 hosts)
1   host      192.0.2.101  100.00%  up
2   host      192.0.2.102  100.00%  up
</pre>
</div>
</div>

<div id="outline-container-org41a9462" class="outline-3">
<h3 id="org41a9462"><span class="section-number-3">2.39</span> Host Checks</h3>
<div class="outline-text-3" id="text-2-39">
<ul class="org-ul">
<li>ICMP checks</li>
<li>TCP port test</li>
<li>HTTP response code check</li>
<li>TLS check</li>
<li>HTTP response code over TLS check</li>
<li>File integrity check</li>
</ul>
</div>
</div>
