openbsd-cheatsheet.org
** More Host Checks
- Exchange arbitrary data
  forward to <smtp> check send "" expect \
  	"220 mail.manosvasilakis.gr *"
- External scripts
  forward to <www> check script \
  	"/usr/local/scripts/dnscheck.sh"

#+BEGIN_SRC sh
#!/bin/sh
! dig www.manosvasilakis.gr @$1 | grep "qr aa rd" \
	> /dev/null
#+END_SRC

** Relays
- Relays accept TCP connection, examine traffic, create new connection
  to destinations
- Can filter traffic

** SSH Relay
#+BEGIN_EXAMPLE
tcp protocol fixup {
	tcp nodelay
}

relay ssh {
	listen on 203.0.113.213 port 2222
	forward to <ssh? port 22
	protocol fixup
}
#+END_EXAMPLE

** Relays let you do weird things
#+BEGIN_EXAMPLE
# bill promised he only uses get method in da site...
http protocol getonly {
	pass quick method GET
	block label "Forbidden Method"
}

# bill promised that he doesn't use phpMyAdmin...
# i don't trust billy.
block request url "www4.manosvasilakis.gr/phpMyAdmin"
	label "Bill is a Wimp"

# no websockets bill :)
block request handler "Upgrade" vaue "websocket"

# but if you really hate bill... strip the user-agent header.
match request handler remove "Users-Agent"
#+END_EXAMPLE

** TLS Acceleration
- Put SSL on the load balancer
#+BEGIN_EXAMPLE
http protocol https {
	match request header append "X-Forwarded-For" \
		value "$REMOTE_ADDR"
	match request header append "X-Forwarded-By" \
		value "$SERVER_ADDR:$SERVER_PORT"
	match request header set "Connection" \
		value "close"
	# Various TCP performance options
	tcp { nodelay, sack, socket buffer 65536, backlog 128 }
}
#+END_EXAMPLE

** Other Relay Fun
- Relays do not do SNI yet
- Enable/disable client-renegotiations, session tickets, etc.
- Can do HA with CARP

** Resources
1. Youtube ([[https://youtube.com/watch?v=u-62QXjhLxk][?v=u-62QXjhLxk]])
