html/openbsd-cheatsheet.html

<div id="outline-container-org638cf3e" class="outline-3">
<h3 id="org638cf3e"><span class="section-number-3">2.40</span> More Host Checks</h3>
<div class="outline-text-3" id="text-2-40">
<ul class="org-ul">
<li>Exchange arbitrary data
forward to &lt;smtp&gt; check send "" expect \
	"220 mail.manosvasilakis.gr *"</li>
<li>External scripts
forward to &lt;www&gt; check script \
	"/usr/local/scripts/dnscheck.sh"</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #a89984;">#</span><span style="color: #a89984;">!/bin/</span><span style="color: #9d0006;">sh</span>
! dig www.manosvasilakis.gr @$<span style="color: #076678;">1</span> | grep <span style="color: #79740e;">"qr aa rd"</span> <span style="color: #79740e;">\</span>
    &gt; /dev/null
</pre>
</div>
</div>
</div>

<div id="outline-container-org4783037" class="outline-3">
<h3 id="org4783037"><span class="section-number-3">2.41</span> Relays</h3>
<div class="outline-text-3" id="text-2-41">
<ul class="org-ul">
<li>Relays accept TCP connection, examine traffic, create new connection
to destinations</li>
<li>Can filter traffic</li>
</ul>
</div>
</div>

<div id="outline-container-orgd223879" class="outline-3">
<h3 id="orgd223879"><span class="section-number-3">2.42</span> SSH Relay</h3>
<div class="outline-text-3" id="text-2-42">
<pre class="example" id="orge60c8a1">
tcp protocol fixup {
	tcp nodelay
}

relay ssh {
	listen on 203.0.113.213 port 2222
	forward to &lt;ssh? port 22
	protocol fixup
}
</pre>
</div>
</div>

<div id="outline-container-org98a6d62" class="outline-3">
<h3 id="org98a6d62"><span class="section-number-3">2.43</span> Relays let you do weird things</h3>
<div class="outline-text-3" id="text-2-43">
<pre class="example" id="orga641776">
# bill promised he only uses get method in da site...
http protocol getonly {
	pass quick method GET
	block label "Forbidden Method"
}

# bill promised that he doesn't use phpMyAdmin...
# i don't trust billy.
block request url "www4.manosvasilakis.gr/phpMyAdmin"
	label "Bill is a Wimp"

# no websockets bill :)
block request handler "Upgrade" vaue "websocket"

# but if you really hate bill... strip the user-agent header.
match request handler remove "Users-Agent"
</pre>
</div>
</div>

<div id="outline-container-org29ffa7b" class="outline-3">
<h3 id="org29ffa7b"><span class="section-number-3">2.44</span> TLS Acceleration</h3>
<div class="outline-text-3" id="text-2-44">
<ul class="org-ul">
<li>Put SSL on the load balancer</li>
</ul>
<pre class="example" id="org80cef99">
http protocol https {
	match request header append "X-Forwarded-For" \
		value "$REMOTE_ADDR"
	match request header append "X-Forwarded-By" \
		value "$SERVER_ADDR:$SERVER_PORT"
	match request header set "Connection" \
		value "close"
	# Various TCP performance options
	tcp { nodelay, sack, socket buffer 65536, backlog 128 }
}
</pre>
</div>
</div>

<div id="outline-container-org0b97977" class="outline-3">
<h3 id="org0b97977"><span class="section-number-3">2.45</span> Other Relay Fun</h3>
<div class="outline-text-3" id="text-2-45">
<ul class="org-ul">
<li>Relays do not do SNI yet</li>
<li>Enable/disable client-renegotiations, session tickets, etc.</li>
<li>Can do HA with CARP</li>
</ul>
</div>
</div>

<div id="outline-container-orgcfe0db9" class="outline-3">
<h3 id="orgcfe0db9"><span class="section-number-3">2.46</span> Resources</h3>
<div class="outline-text-3" id="text-2-46">
<ol class="org-ol">
<li>Youtube (<a href="https://youtube.com/watch?v=u-62QXjhLxk">?v=u-62QXjhLxk</a>)</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Manos Vasilakis (advizor.gr)</p>
<p class="date">Created: 2022-01-23 Sun 12:24</p>
</div>
</body>
</html>
